In [1]:
import pandas as pd

## Series

In [2]:
## Creating empty series
d=pd.Series()

C:\Users\Dell\AppData\Local\Temp\ipykernel_16760\779336895.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  d=pd.Series()

In [3]:
d

Series([], dtype: float64)

In [4]:
type(d)

pandas.core.series.Series

In [5]:
## Creating series with one element
d=pd.Series(17)

In [6]:
d

0    17
dtype: int64

In [7]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)

In [8]:
d

0    10
1    11
2    12
dtype: int64

In [9]:
##  creating series using list
d=pd.Series([45,78,56,445,78])

In [10]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [11]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [12]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [13]:
s2 = pd.Series(arr2)

ValueError: Data must be 1-dimensional

In [14]:
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [15]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [16]:
d.values()

dict_values([1, 2, 3, 4])

In [17]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [18]:
d['b']

2

In [19]:
b=pd.Series(d)

In [20]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [21]:
b[0]

1

In [22]:
b['a']

1

In [ ]:
import numpy as np

In [23]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [24]:
d[0:9]

0     1
1     2
2     3
3     5
4    47
5    98
6     7
7     8
8     6
dtype: int64

In [25]:
d[[4,5,3,6]] ## multiple index

4    47
5    98
3     5
6     7
dtype: int64

In [26]:
d[4]=34  ## changing the element

In [27]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [28]:
d[6:10]=[100,200,300,400]

In [29]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [30]:
arr3=np.array([11,22,44,66])
s=pd.Series(arr3,index=['one','Two','Three','Four'])

In [31]:
print(s)

one      11
Two      22
Three    44
Four     66
dtype: int32

## DataFrame

In [32]:
import pandas as pd## empty dataframe
d=pd.DataFrame()

In [33]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [34]:
d

Empty DataFrame
Columns: []
Index: []

In [35]:
type(d)

pandas.core.frame.DataFrame

In [ ]:
#import pandas as pd

In [36]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','a']]

In [37]:
data

[['abc', 1], ['def', 2], ['ghi', 3], ['hij'], ['klm', 'a']]

In [38]:
d=pd.DataFrame(data,columns=['word','number']) ## chnaging the column 
d

  word number
0  abc      1
1  def      2
2  ghi      3
3  hij   None
4  klm      a

In [39]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [40]:
d

     A     B
A  abc     1
B  def     2
C  ghi     3
D  hij  None
E  klm     a

In [41]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [42]:
d=pd.DataFrame(data)
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [45]:
d.rename({'name':'Candidate','age':'Age_years'},axis=1,inplace=True)

In [46]:
d

  Candidate  Age_years
0         a         45
1         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [47]:
d.rename({0:'A',1:'B'},axis=0,inplace=True)

In [48]:
d

  Candidate  Age_years
A         a         45
B         b         12
2         c         48
3         d         25
4         e         12
5         f         56

In [49]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [50]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [51]:
import pandas as pd
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [52]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [53]:
d.Name

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [54]:
## accessing one single column
d['Name']

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [55]:
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [56]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [57]:
d.iloc[0,0] ="ALEX"  # changing an element

In [58]:
d

    Name  Age  Subject
0   ALEX   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [59]:
d['Gender'] = "Male"  # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALEX   10    Maths   Male
1    Bob   12  Science   Male
2  Kelly   15      Eco   Male
3  Boris   14      Geo   Male
4    Ken   18  English   Male

In [60]:
d.iloc[2,3]="Female"

In [61]:
d

    Name  Age  Subject  Gender
0   ALEX   10    Maths    Male
1    Bob   12  Science    Male
2  Kelly   15      Eco  Female
3  Boris   14      Geo    Male
4    Ken   18  English    Male

In [62]:
d['Age'] = d['Age'] - 1   # d['Age']-=1
d

    Name  Age  Subject  Gender
0   ALEX    9    Maths    Male
1    Bob   11  Science    Male
2  Kelly   14      Eco  Female
3  Boris   13      Geo    Male
4    Ken   17  English    Male

In [63]:
d

    Name  Age  Subject  Gender
0   ALEX    9    Maths    Male
1    Bob   11  Science    Male
2  Kelly   14      Eco  Female
3  Boris   13      Geo    Male
4    Ken   17  English    Male

In [64]:
d.iloc[:,[0,1]] # Index location

    Name  Age
0   ALEX    9
1    Bob   11
2  Kelly   14
3  Boris   13
4    Ken   17

In [65]:
d.iloc[[3,1],[0,1]]  # [row,col]

    Name  Age
3  Boris   13
1    Bob   11

In [66]:
d.iloc[1:3,[0,1]]

    Name  Age
1    Bob   11
2  Kelly   14

In [67]:
d.iloc[1]  # access row 1

Name           Bob
Age             11
Subject    Science
Gender        Male
Name: 1, dtype: object

In [68]:
pwd

'C:\\Users\\Datamites\\Desktop\\My Data CDS\\03-Machine Learning Associate\\03-Pandas'

In [69]:
d

    Name  Age  Subject  Gender
0   ALEX    9    Maths    Male
1    Bob   11  Science    Male
2  Kelly   14      Eco  Female
3  Boris   13      Geo    Male
4    Ken   17  English    Male

In [70]:
## to acces the single element we use iloc it will always work with index
d.iloc[0,2] ## index of row ,columns

'Maths'

loc used for locating with column names

In [71]:
d

    Name  Age  Subject  Gender
0   ALEX    9    Maths    Male
1    Bob   11  Science    Male
2  Kelly   14      Eco  Female
3  Boris   13      Geo    Male
4    Ken   17  English    Male

In [72]:
## loc will work on rows as well as names of columns
d.loc[:2,['Name','Subject']]

    Name  Subject
0   ALEX    Maths
1    Bob  Science
2  Kelly      Eco

In [73]:
# Modify multiple values
d.iloc[:2,0]= ['abc','xyz']

In [74]:
d

    Name  Age  Subject  Gender
0    abc    9    Maths    Male
1    xyz   11  Science    Male
2  Kelly   14      Eco  Female
3  Boris   13      Geo    Male
4    Ken   17  English    Male

In [75]:
d.loc[:,'Name']

0      abc
1      xyz
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [ ]:
# loc is typically used for accessing columns.

In [76]:
d['Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [77]:
d.loc[:,'Age']

0     9
1    11
2    14
3    13
4    17
Name: Age, dtype: int64

In [78]:
d

    Name  Age  Subject  Gender
0    abc    9    Maths    Male
1    xyz   11  Science    Male
2  Kelly   14      Eco  Female
3  Boris   13      Geo    Male
4    Ken   17  English    Male

In [79]:
d.loc[3] ## getting the rows with singular index value

Name       Boris
Age           13
Subject      Geo
Gender      Male
Name: 3, dtype: object

In [80]:
d.iloc[:,[1,2]]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco
3   13      Geo
4   17  English

In [81]:
d.iloc[:3,1:3]

   Age  Subject
0    9    Maths
1   11  Science
2   14      Eco

In [ ]:
d